; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 6)
	(= (value c1) 67)
	(= (value c2) 98)
	(= (value c3) 64)
	(= (value c4) 6)
	(= (value c5) 30)
	(= (value c6) 38)
	(= (value c7) 1)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 7
2. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 7
3. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 7
4. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 4 of 7
5. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 4 of 7
6. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 4 of 7
7. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 4 of 7
8. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 4 of 7
9. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 4 of 7
10. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 4 of 7
11. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 4 of 7
12. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 4 of 7
13. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 4 of 7
14. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 4 of 7
15. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 4 of 7
16. (increment c7)
   changed: (value c7) from 1 to 9
   goals met: 4 of 7
17. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 7
18. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 7
19. (increment c7)
   changed: (value c7) from 9 to 17
   goals met: 4 of 7
20. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 4 of 7
21. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 4 of 7
22. (increment c7)
   changed: (value c7) from 17 to 27
   goals met: 4 of 7
23. (increment c7)
   changed: (value c7) from 27 to 37
   goals met: 4 of 7
24. (increment c7)
   changed: (value c7) from 37 to 47
   goals met: 5 of 7
25. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 5 of 7
26. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 5 of 7
27. (increment c4)
   changed: (value c4) from 6 to 14
   goals met: 5 of 7
28. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 5 of 7
29. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 5 of 7
30. (decrement_rate c3)
   changed: (rate_value c3) from 1 to 0
   goals met: 5 of 7
31. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 5 of 7
32. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 5 of 7
33. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 5 of 7
34. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 7
35. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 7
36. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 5 of 7
37. (increment c4)
   changed: (value c4) from 14 to 23
   goals met: 5 of 7
38. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 5 of 7
39. (decrement c2)
   changed: (value c2) from 98 to 93
   goals met: 5 of 7
40. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 5 of 7
41. (decrement c2)
   changed: (value c2) from 93 to 88
   goals met: 5 of 7
42. (decrement c2)
   changed: (value c2) from 88 to 83
   goals met: 5 of 7
43. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 5 of 7
44. (increment c4)
   changed: (value c4) from 23 to 33
   goals met: 4 of 7
45. (increment c4)
   changed: (value c4) from 33 to 43
   goals met: 4 of 7
46. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 7
47. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 7
48. (increment c5)
   changed: (value c5) from 30 to 32
   goals met: 4 of 7
49. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 4 of 7
50. (increment c3)
   changed: (value c3) from 64 to 69
   goals met: 4 of 7
51. (decrement c2)
   changed: (value c2) from 83 to 78
   goals met: 4 of 7
52. (decrement c2)
   changed: (value c2) from 78 to 73
   goals met: 4 of 7
53. (decrement c2)
   changed: (value c2) from 73 to 68
   goals met: 5 of 7
54. (decrement c3)
   changed: (value c3) from 69 to 64
   goals met: 4 of 7
55. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 4 of 7
56. (decrement c3)
   changed: (value c3) from 64 to 58
   goals met: 4 of 7
57. (increment c5)
   changed: (value c5) from 32 to 34
   goals met: 4 of 7
58. (increment c3)
   changed: (value c3) from 58 to 64
   goals met: 4 of 7
59. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 4 of 7
60. (increment c3)
   changed: (value c3) from 64 to 71
   goals met: 5 of 7
61. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 5 of 7
62. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 5 of 7
63. (decrement c4)
   changed: (value c4) from 43 to 33
   goals met: 6 of 7
64. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 6 of 7
65. (decrement c3)
   changed: (value c3) from 71 to 61
   goals met: 5 of 7
66. (decrement c3)
   changed: (value c3) from 61 to 51
   goals met: 5 of 7
67. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 5 of 7
68. (decrement c2)
   changed: (value c2) from 68 to 62
   goals met: 4 of 7
69. (decrement c2)
   changed: (value c2) from 62 to 56
   goals met: 4 of 7
70. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 7
71. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 7
72. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 7
73. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 7
74. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 7
75. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 7
76. (decrement c2)
   changed: (value c2) from 56 to 50
   goals met: 5 of 7
77. (decrement c1)
   changed: (value c1) from 67 to 61
   goals met: 5 of 7
78. (decrement c1)
   changed: (value c1) from 61 to 55
   goals met: 5 of 7
79. (decrement c1)
   changed: (value c1) from 55 to 49
   goals met: 6 of 7
80. (decrement c3)
   changed: (value c3) from 51 to 41
   goals met: 5 of 7
81. (decrement c3)
   changed: (value c3) from 41 to 31
   goals met: 6 of 7
82. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 6 of 7
83. (decrement c2)
   changed: (value c2) from 50 to 43
   goals met: 5 of 7
84. (decrement c2)
   changed: (value c2) from 43 to 36
   goals met: 5 of 7
85. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 5 of 7
86. (decrement c2)
   changed: (value c2) from 36 to 29
   goals met: 6 of 7
87. (decrement c1)
   changed: (value c1) from 49 to 42
   goals met: 6 of 7
88. (decrement c1)
   changed: (value c1) from 42 to 35
   goals met: 6 of 7
89. (decrement c1)
   changed: (value c1) from 35 to 28
   goals met: 7 of 7
